``` sql
Table Script:

CREATE TABLE Student(
    Id INT,
    StudentName VARCHAR (50),
    Math INT,English INT,
    History INT,Science INT);

INSERT INTO Student VALUES (1,'Ashok', 78, 85, 91, 76 );
INSERT INTO Student VALUES (2,'Raj', 87, 90, 82, 87);
INSERT INTO Student VALUES (3,'Yusuf',95,80,65,77);

select * from Student;

+------+-------------+------+---------+---------+---------+
| Id   | StudentName | Math | English | History | Science |
+------+-------------+------+---------+---------+---------+
|    1 | Ashok       |   78 |      85 |      91 |      76 |
|    2 | Raj         |   87 |      90 |      82 |      87 |
|    3 | Yusuf       |   95 |      80 |      65 |      77 |
+------+-------------+------+---------+---------+---------+

Q.Write an SQL query to find the total marks scored by each student.

Expected Output

+-------------+-------------+
| StudentName | total_marks |
+-------------+-------------+
| Ashok       |         330 |
| Raj         |         346 |
| Yusuf       |         317 |
+-------------+-------------+

### **Solution-1:**
``` sql
select StudentName, (Math + English + History + Science) as total_marks
from Student;